INSERT INTO courses (course_id, course_name, course_type, capacity) VALUES
('C000001', 'Java程序设计', '专业课', 80),
('C000002', '数据库原理', '专业课', 80),
('C000003', '高等数学', '公共课', 120),
('C000004', '音乐鉴赏', '选修课', 60);

INSERT INTO enrollments (student_id, course_id, enroll_time) VALUES
('S000003', 'C000002', '2026-03-01 09:00:00'),
('S000001', 'C000001', '2026-03-01 09:05:00'),
('S000002', 'C000003', '2026-03-01 09:10:00'),
('S000001', 'C000001', '2026-03-01 09:15:00'),
('S000001', 'C000002', '2026-03-01 09:20:00'),
('S000004', 'C000004', '2026-03-01 09:25:00');
